#+TITLE: *An example to show how to write LaTeX using org-article*
#+AUTHOR: Zuogong YUE
#+EMAIL:  zuogong.yue@uni.lu
#+SETUPFILE: "./org_latex_headers.org"

\vspace{4em}
#+BEGIN_ABSTRACT
This is an *abstract* in Org-mode.
#+END_ABSTRACT
\vspace{2em}

** Equations
The equation (\ref{eq:1}) is a direct equation written in LaTeX code. It can be used without the macro =#+BEGIN_LATEX .. #+END_LATEX=, which is helpful to fold to make codes clean. The inline equation could be preview inline, for instance, $x(t) = \frac{e^t}{1 + t^2}$, by hit =C-C C-X C-l= and =C-C C-C= to remove images.
#+BEGIN_LaTeX
\begin{equation}
    \begin{bmatrix}
        A_{11} & A_{12} \\ A_{21} & A_{22}
    \end{bmatrix}
    \begin{bmatrix}
        x_1 \\ x_2
    \end{bmatrix} = 
    \begin{bmatrix}
        b_1 \\ b_2
    \end{bmatrix}
    \label{eq:1}
\end{equation}
#+END_LaTeX

If expecting the LaTeX code to be colored in =.org= files, the LaTeX code can be included in the source code macro, as shown in (\ref{eq:2}) and its source codes. Set to export results only and evaluate the code block to generate LaTeX code.
#+begin_src latex :exports both
\begin{equation}
    \bold{A} \mathbf{X} = \bold{b}
    \label{eq:2}
\end{equation}
#+end_src
#+RESULTS:
#+BEGIN_LaTeX
\begin{equation}
    \bold{A} \mathbf{X} = \bold{b}
    \label{eq:2}
\end{equation}
#+END_LaTeX

